vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.h
/*
 * Audio.h
 *
 *  Created on: Oct 28,2018
 *  Updated on: Nov 22,2022
 *      Author: Wolle (schreibfaul1)
 */

// #define SDFATFS_USED  // activate for SdFat

// Disable network features to reduce binary size (local file playback only)
// Uncomment to disable: HTTP/HTTPS streams, TTS, playlists, ICY metadata
#define AUDIO_NO_NETWORK

#pragma once
#pragma GCC optimize("Ofast")
#include <Arduino.h>
#include <esp32-hal-log.h>
#include <libb64/cencode.h>
#include <vector>

#include <SPI.h>
#ifndef AUDIO_NO_NETWORK
#include <WiFi.h>
#include <WiFiClientSecure.h>
#endif
#include <driver/i2s.h>
#include <vector>

#ifdef SDFATFS_USED
#include <SdFat.h> // https://github.com/greiman/SdFat
#else
#include <FFat.h>
#include <FS.h>
#include <SD.h>
#include <SD_MMC.h>
#include <SPIFFS.h>
#endif // SDFATFS_USED

#ifdef SDFATFS_USED
// typedef File32 File;
typedef FsFile File;

namespace fs {
class FS : public SdFat {
public:
  bool begin(SdCsPin_t csPin = SS, uint32_t maxSck = SD_SCK_MHZ(25)) {
    return SdFat::begin(csPin, maxSck);
  }
};

class SDFATFS : public fs::FS {
public:
  // sdcard_type_t cardType();
  uint64_t cardSize() { return totalBytes(); }
  uint64_t usedBytes() {
    // set SdFatConfig MAINTAIN_FREE_CLUSTER_COUNT non-zero. Then only the first
    // call will take time.
    return (uint64_t)(clusterCount() - freeClusterCount()) *
           (uint64_t)bytesPerCluster();
  }
  uint64_t totalBytes() {
    return (uint64_t)clusterCount() * (uint64_t)bytesPerCluster();
  }
};
} // namespace fs

extern fs::SDFATFS SD_SDFAT;

using namespace fs;
#define SD SD_SDFAT
#endif // SDFATFS_USED

using namespace std;

extern __attribute__((weak)) void audio_info(const char *);
extern __attribute__((weak)) void audio_id3data(const char *); // ID3 metadata
extern __attribute__((weak)) void
audio_id3image(File &file, const size_t pos,
               const size_t size); // ID3 metadata image
extern __attribute__((weak)) void audio_eof_mp3(const char *); // end of mp3
                                                               // file
extern __attribute__((weak)) void audio_showstreamtitle(const char *);
extern __attribute__((weak)) void audio_showstation(const char *);
extern __attribute__((weak)) void audio_bitrate(const char *);
extern __attribute__((weak)) void audio_commercial(const char *);
extern __attribute__((weak)) void audio_icyurl(const char *);
extern __attribute__((weak)) void audio_icydescription(const char *);
extern __attribute__((weak)) void audio_lasthost(const char *);
extern __attribute__((weak)) void audio_eof_speech(const char *);
extern __attribute__((weak)) void
audio_eof_stream(const char *); // The webstream comes to an end
extern __attribute__((weak)) void
audio_process_extern(int16_t *buff, uint16_t len,
                     bool *continueI2S); // record audiodata or send via BT
extern __attribute__((weak)) void
audio_process_i2s(uint32_t *sample,
                  bool *continueI2S); // record audiodata or send via BT

#define AUDIO_INFO(...)                                                        \
  {                                                                            \
    char buff[512 + 64];                                                       \
    sprintf(buff, __VA_ARGS__);                                                \
    if (audio_info)                                                            \
      audio_info(buff);                                                        \
  }

//----------------------------------------------------------------------------------------------------------------------

class AudioBuffer {
  // AudioBuffer will be allocated in PSRAM, If PSRAM not available or has not
  // enough space AudioBuffer will be allocated in FlashRAM with reduced size
  //
  //  m_buffer            m_readPtr                 m_writePtr m_endPtr
  //   |                       |<------dataLength------->|<------ writeSpace
  //   ----->| ▼                       ▼                         ▼ ▼
  //   ---------------------------------------------------------------------------------------------------------------
  //   |                     <--m_buffSize--> |      <--m_resBuffSize -->     |
  //   ---------------------------------------------------------------------------------------------------------------
  //   |<-----freeSpace------->| |<------freeSpace-------->|
  //
  //
  //
  //   if the space between m_readPtr and buffend < m_resBuffSize copy data from
  //   the beginning to resBuff so that the mp3/aac/flac frame is always
  //   completed
  //
  //  m_buffer                      m_writePtr                 m_readPtr
  //  m_endPtr
  //   | |<-------writeSpace------>|<--dataLength-->| ▼ ▼ ▼                ▼
  //   ---------------------------------------------------------------------------------------------------------------
  //   |                        <--m_buffSize--> |      <--m_resBuffSize --> |
  //   ---------------------------------------------------------------------------------------------------------------
  //   |<---  ------dataLength--  ------>|<-------freeSpace------->|
  //
  //

public:
  AudioBuffer(size_t maxBlockSize = 0); // constructor
  ~AudioBuffer();                       // frees the buffer
  size_t init();                        // set default values
  bool isInitialized() { return m_f_init; };
  void setBufsize(int ram, int psram);
  void changeMaxBlockSize(
      uint16_t mbs); // is default 1600 for mp3 and aac, set 16384 for FLAC
  uint16_t getMaxBlockSize();   // returns maxBlockSize
  size_t freeSpace();           // number of free bytes to overwrite
  size_t writeSpace();          // space fom writepointer to bufferend
  size_t bufferFilled();        // returns the number of filled bytes
  void bytesWritten(size_t bw); // update writepointer
  void bytesWasRead(size_t br); // update readpointer
  uint8_t *getWritePtr();       // returns the current writepointer
  uint8_t *getReadPtr();        // returns the current readpointer
  uint32_t getWritePos();       // write position relative to the beginning
  uint32_t getReadPos();        // read position relative to the beginning
  void resetBuffer();           // restore defaults
  bool havePSRAM() { return m_f_psram; };

protected:
  size_t m_buffSizePSRAM =
      300000; // most webstreams limit the advance to 100...300Kbytes
  size_t m_buffSizeRAM = 1600 * 5;
  size_t m_buffSize = 0;
  size_t m_freeSpace = 0;
  size_t m_writeSpace = 0;
  size_t m_dataLength = 0;
  size_t m_resBuffSizeRAM = 1600;       // reserved buffspace, >= one mp3  frame
  size_t m_resBuffSizePSRAM = 4096 * 4; // reserved buffspace, >= one flac frame
  size_t m_maxBlockSize = 1600;
  uint8_t *m_buffer = NULL;
  uint8_t *m_writePtr = NULL;
  uint8_t *m_readPtr = NULL;
  uint8_t *m_endPtr = NULL;
  bool m_f_start = true;
  bool m_f_init = false;
  bool m_f_psram = false; // PSRAM is available (and used...)
};
//----------------------------------------------------------------------------------------------------------------------

class Audio : private AudioBuffer {

