vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.h
  AudioBuffer InBuff; // instance of input buffer

public:
  Audio(bool internalDAC = false, uint8_t channelEnabled = 3,
        uint8_t i2sPort = I2S_NUM_0); // #99
  ~Audio();
  void setBufsize(int rambuf_sz, int psrambuf_sz);
#ifndef AUDIO_NO_NETWORK
  bool connecttohost(const char *host, const char *user = "",
                     const char *pwd = "");
  bool connecttospeech(const char *speech, const char *lang);
  bool connecttomarytts(const char *speech, const char *lang,
                        const char *voice);
#endif
  bool connecttoFS(fs::FS &fs, const char *path, uint32_t resumeFilePos = 0);
  bool connecttoSD(const char *path, uint32_t resumeFilePos = 0);
  bool setFileLoop(bool input); // TEST loop
#ifndef AUDIO_NO_NETWORK
  void setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl);
#endif
  bool setAudioPlayPosition(uint16_t sec);
  bool setFilePos(uint32_t pos);
  bool audioFileSeek(const float speed);
  bool setTimeOffset(int sec);
  bool setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT,
                 int8_t DIN = I2S_PIN_NO_CHANGE,
                 int8_t MCK = I2S_PIN_NO_CHANGE);
  bool pauseResume();
  bool isRunning() { return m_f_running; }
  void loop();
  uint32_t stopSong();
  void forceMono(bool m);
  void setBalance(int8_t bal = 0);
  void setVolume(uint8_t vol);
  uint8_t getVolume();
  uint8_t getI2sPort();

  uint32_t getAudioDataStartPos();
  uint32_t getFileSize();
  uint32_t getFilePos();
  uint32_t getSampleRate();
  uint8_t getBitsPerSample();
  uint8_t getChannels();
  uint32_t getBitRate(bool avg = false);
  uint32_t getAudioFileDuration();
  uint32_t getAudioCurrentTime();
  uint32_t getTotalPlayingTime();

  esp_err_t i2s_mclk_pin_select(const uint8_t pin);
  uint32_t
  inBufferFilled(); // returns the number of stored bytes in the inputbuffer
  uint32_t
  inBufferFree(); // returns the number of free bytes in the inputbuffer
  void setTone(int8_t gainLowPass, int8_t gainBandPass, int8_t gainHighPass);
  void setI2SCommFMT_LSB(bool commFMT);
  int getCodec() { return m_codec; }
  const char *getCodecname() { return codecname[m_codec]; }

private:
#ifndef ESP_ARDUINO_VERSION_VAL
#define ESP_ARDUINO_VERSION_MAJOR 0
#define ESP_ARDUINO_VERSION_MINOR 0
#define ESP_ARDUINO_VERSION_PATCH 0
#endif

  void UTF8toASCII(char *str);
  bool latinToUTF8(char *buff, size_t bufflen);
  void setDefaults(); // free buffers and set defaults
  void initInBuff();
#ifndef AUDIO_NO_NETWORK
  bool httpPrint(const char *host);
  void processWebStream();
  void processWebFile();
  void processWebStreamTS();
  void processWebStreamHLS();
  bool readPlayListData();
  const char *parsePlaylist_M3U();
  const char *parsePlaylist_PLS();
  const char *parsePlaylist_ASX();
  const char *parsePlaylist_M3U8();
#endif
  void processLocalFile();
  void playAudioData();
  bool STfromEXTINF(char *str);
  void showCodecParams();
  int findNextSync(uint8_t *data, size_t len);
  int sendBytes(uint8_t *data, size_t len);
  void compute_audioCurrentTime(int bd);
  void printDecodeError(int r);
  void showID3Tag(const char *tag, const char *val);
  void unicode2utf8(char *buff, uint32_t len);
  size_t readAudioHeader(uint32_t bytes);
  int read_WAV_Header(uint8_t *data, size_t len);
  int read_FLAC_Header(uint8_t *data, size_t len);
  int read_ID3_Header(uint8_t *data, size_t len);
  int read_M4A_Header(uint8_t *data, size_t len);
  int read_OGG_Header(uint8_t *data, size_t len);
  size_t process_m3u8_ID3_Header(uint8_t *packet);
  bool setSampleRate(uint32_t hz);
  bool setBitsPerSample(int bits);
  bool setChannels(int channels);
  bool setBitrate(int br);
  bool playChunk();
  bool playSample(int16_t sample[2]);
  void playI2Sremains();
  int32_t Gain(int16_t s[2]);
  bool fill_InputBuf();
  void showstreamtitle(const char *ml);
#ifndef AUDIO_NO_NETWORK
  bool parseContentType(char *ct);
  bool parseHttpResponseHeader();
#endif
  bool initializeDecoder();
  esp_err_t I2Sstart(uint8_t i2s_num);
  esp_err_t I2Sstop(uint8_t i2s_num);
#ifndef AUDIO_NO_NETWORK
  void urlencode(char *buff, uint16_t buffLen, bool spacesOnly = false);
#endif
  int16_t *IIR_filterChain0(int16_t iir_in[2], bool clear = false);
  int16_t *IIR_filterChain1(int16_t *iir_in, bool clear = false);
  int16_t *IIR_filterChain2(int16_t *iir_in, bool clear = false);
  inline void setDatamode(uint8_t dm) { m_datamode = dm; }
  inline uint8_t getDatamode() { return m_datamode; }
#ifndef AUDIO_NO_NETWORK
  inline uint32_t streamavail() { return _client ? _client->available() : 0; }
#else
  inline uint32_t streamavail() { return 0; }
#endif
  void IIR_calculateCoefficients(int8_t G1, int8_t G2, int8_t G3);
  bool ts_parsePacket(uint8_t *packet, uint8_t *packetStart,
                      uint8_t *packetLength);

//+++ W E B S T R E A M  -  H E L P   F U N C T I O N S +++
#ifndef AUDIO_NO_NETWORK
  uint16_t readMetadata(uint16_t b, bool first = false);
  size_t chunkedDataTransfer(uint8_t *bytes);
  void slowStreamDetection(uint32_t inBuffFilled, uint32_t maxFrameSize);
  void lostStreamDetection(uint32_t bytesAvail);
#endif
  bool readID3V1Tag();
  void seek_m4a_stsz();
  uint32_t m4a_correctResumeFilePos(uint32_t resumeFilePos);
  uint32_t flac_correctResumeFilePos(uint32_t resumeFilePos);
  uint32_t mp3_correctResumeFilePos(uint32_t resumeFilePos);

  //++++ implement several function with respect to the index of string ++++
  void trim(char *s) {
    // fb   trim in place
    char *pe;
    char *p = s;
    while (isspace(*p))
      p++;  // left
    pe = p; // right
    while (*pe != '\0')
      pe++;
    do {
      pe--;
    } while ((pe > p) && isspace(*pe));
    if (p == s) {
      *++pe = '\0';
    } else { // move
      while (p <= pe)
        *s++ = *p++;
      *s = '\0';
    }
  }

  bool startsWith(const char *base, const char *str) {
    // fb
    char c;
    while ((c = *str++) != '\0')
      if (c != *base++)
        return false;
    return true;
  }

  bool endsWith(const char *base, const char *str) {
    // fb
    int slen = strlen(str) - 1;
    const char *p = base + strlen(base) - 1;
    while (p > base && isspace(*p))
      p--; // rtrim
    p -= slen;
    if (p < base)
      return false;
    return (strncmp(p, str, slen) == 0);
  }

