vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.h
  int indexOf(const char *base, const char *str, int startIndex = 0) {
    // fb
    const char *p = base;
    for (; startIndex > 0; startIndex--)
      if (*p++ == '\0')
        return -1;
    char *pos = strstr(p, str);
    if (pos == nullptr)
      return -1;
    return pos - base;
  }

  int indexOf(const char *base, char ch, int startIndex = 0) {
    // fb
    const char *p = base;
    for (; startIndex > 0; startIndex--)
      if (*p++ == '\0')
        return -1;
    char *pos = strchr(p, ch);
    if (pos == nullptr)
      return -1;
    return pos - base;
  }

  int lastIndexOf(const char *haystack, const char *needle) {
    // fb
    int nlen = strlen(needle);
    if (nlen == 0)
      return -1;
    const char *p = haystack - nlen + strlen(haystack);
    while (p >= haystack) {
      int i = 0;
      while (needle[i] == p[i])
        if (++i == nlen)
          return p - haystack;
      p--;
    }
    return -1;
  }

  int lastIndexOf(const char *haystack, const char needle) {
    // fb
    const char *p = strrchr(haystack, needle);
    return (p ? p - haystack : -1);
  }

  int specialIndexOf(uint8_t *base, const char *str, int baselen,
                     bool exact = false) {
    int result; // seek for str in buffer or in header up to baselen, not
                // nullterninated
    if (strlen(str) > baselen)
      return -1; // if exact == true seekstr in buffer must have "\0" at the end
    for (int i = 0; i < baselen - strlen(str); i++) {
      result = i;
      for (int j = 0; j < strlen(str) + exact; j++) {
        if (*(base + i + j) != *(str + j)) {
          result = -1;
          break;
        }
      }
      if (result >= 0)
        break;
    }
    return result;
  }

  // some other functions
  size_t bigEndian(uint8_t *base, uint8_t numBytes, uint8_t shiftLeft = 8) {
    uint64_t result = 0;
    if (numBytes < 1 || numBytes > 8)
      return 0;
    for (int i = 0; i < numBytes; i++) {
      result += *(base + i) << (numBytes - i - 1) * shiftLeft;
    }
    if (result > SIZE_MAX) {
      log_e("range overflow");
      result = 0;
    } // overflow
    return (size_t)result;
  }

  bool b64encode(const char *source, uint16_t sourceLength, char *dest) {
    size_t size = base64_encode_expected_len(sourceLength) + 1;
    char *buffer = (char *)malloc(size);
    if (buffer) {
      base64_encodestate _state;
      base64_init_encodestate(&_state);
      int len =
          base64_encode_block(&source[0], sourceLength, &buffer[0], &_state);
      len = base64_encode_blockend((buffer + len), &_state);
      memcpy(dest, buffer, strlen(buffer));
      dest[strlen(buffer)] = '\0';
      free(buffer);
      return true;
    }
    return false;
  }
  size_t urlencode_expected_len(const char *source) {
    size_t expectedLen = strlen(source);
    for (int i = 0; i < strlen(source); i++) {
      if (isalnum(source[i])) {
        ;
      } else
        expectedLen += 2;
    }
    return expectedLen;
  }
  void vector_clear_and_shrink(vector<char *> &vec) {
    uint size = vec.size();
    for (int i = 0; i < size; i++) {
      if (vec[i]) {
        free(vec[i]);
        vec[i] = NULL;
      }
    }
    vec.clear();
    vec.shrink_to_fit();
  }
  uint32_t simpleHash(const char *str) {
    if (str == NULL)
      return 0;
    uint32_t hash = 0;
    for (int i = 0; i < strlen(str); i++) {
      if (str[i] < 32)
        continue; // ignore control sign
      hash += (str[i] - 31) * i * 32;
    }
    return hash;
  }

private:
  const char *codecname[9] = {"unknown", "WAV", "MP3",      "AAC", "M4A",
                              "FLAC",    "OGG", "OGG FLAC", "OPUS"};
  enum : int { APLL_AUTO = -1, APLL_ENABLE = 1, APLL_DISABLE = 0 };
  enum : int { EXTERNAL_I2S = 0, INTERNAL_DAC = 1, INTERNAL_PDM = 2 };
  enum : int {
    FORMAT_NONE = 0,
    FORMAT_M3U = 1,
    FORMAT_PLS = 2,
    FORMAT_ASX = 3,
    FORMAT_M3U8 = 4
  };
  enum : int {
    AUDIO_NONE,
    HTTP_RESPONSE_HEADER,
    AUDIO_DATA,
    AUDIO_LOCALFILE,
    AUDIO_PLAYLISTINIT,
    AUDIO_PLAYLISTHEADER,
    AUDIO_PLAYLISTDATA
  };
  enum : int {
    FLAC_BEGIN = 0,
    FLAC_MAGIC = 1,
    FLAC_MBH = 2,
    FLAC_SINFO = 3,
    FLAC_PADDING = 4,
    FLAC_APP = 5,
    FLAC_SEEK = 6,
    FLAC_VORBIS = 7,
    FLAC_CUESHEET = 8,
    FLAC_PICTURE = 9,
    FLAC_OKAY = 100
  };
  enum : int {
    M4A_BEGIN = 0,
    M4A_FTYP = 1,
    M4A_CHK = 2,
    M4A_MOOV = 3,
    M4A_FREE = 4,
    M4A_TRAK = 5,
    M4A_MDAT = 6,
    M4A_ILST = 7,
    M4A_MP4A = 8,
    M4A_AMRDY = 99,
    M4A_OKAY = 100
  };
  enum : int {
    OGG_BEGIN = 0,
    OGG_MAGIC = 1,
    OGG_HEADER = 2,
    OGG_FIRST = 3,
    OGG_AMRDY = 99,
    OGG_OKAY = 100
  };
  enum : int {
    CODEC_NONE = 0,
    CODEC_WAV = 1,
    CODEC_MP3 = 2,
    CODEC_AAC = 3,
    CODEC_M4A = 4,
    CODEC_FLAC = 5,
    CODEC_OGG = 6,
    CODEC_OGG_FLAC = 7,
    CODEC_OGG_OPUS = 8,
    CODEC_AACP = 9
  };
  enum : int { ST_NONE = 0, ST_WEBFILE = 1, ST_WEBSTREAM = 2 };
  typedef enum { LEFTCHANNEL = 0, RIGHTCHANNEL = 1 } SampleIndex;
  typedef enum { LOWSHELF = 0, PEAKEQ = 1, HIFGSHELF = 2 } FilterType;

  const uint8_t volumetable[22] = {0,  1,  2,  3,  4,  6,  8,  10,
                                   12, 14, 17, 20, 23, 27, 30, 34,
                                   38, 43, 48, 52, 58, 64}; // 22 elements

  typedef struct _filter {
    float a0;
    float a1;
    float a2;
    float b1;
    float b2;
  } filter_t;

  typedef struct _pis_array {
    int number;
    int pids[4];
  } pid_array;

  File audiofile; // @suppress("Abstract class cannot be instantiated")
#ifndef AUDIO_NO_NETWORK
  WiFiClient client; // @suppress("Abstract class cannot be instantiated")
  WiFiClientSecure
      clientsecure; // @suppress("Abstract class cannot be instantiated")
  WiFiClient *_client = nullptr;
  std::vector<char *> m_playlistContent; // m3u8 playlist buffer
  std::vector<char *> m_playlistURL;     // m3u8 streamURLs buffer
  std::vector<uint32_t> m_hashQueue;
#endif
  i2s_config_t m_i2s_config = {}; // stores values for I2S driver
  i2s_pin_config_t m_pin_config = {};

  const size_t m_frameSizeWav = 1024;
  const size_t m_frameSizeMP3 = 1600;
  const size_t m_frameSizeAAC = 1600;
  const size_t m_frameSizeFLAC = 4096 * 4;

  static const uint8_t m_tsPacketSize = 188;
  static const uint8_t m_tsHeaderSize = 4;

