vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.h
  char *m_chbuf = NULL;
  uint16_t m_chbufSize = 0; // will set in constructor (depending on PSRAM)
#ifndef AUDIO_NO_NETWORK
  char m_lastHost[512];        // Store the last URL to a webstream
  char *m_playlistBuff = NULL; // stores playlistdata
  const uint16_t m_plsBuffEntryLen =
      256; // length of each entry in playlistBuff
#endif
  filter_t m_filter[3]; // digital filters
  int m_LFcount = 0;    // Detection of end of header
  uint32_t m_sampleRate = 16000;
  uint32_t m_bitRate = 0;     // current bitrate given fom decoder
  uint32_t m_avr_bitrate = 0; // average bitrate, median computed by VBR
  int m_readbytes = 0;        // bytes read
  uint32_t m_metacount = 0;   // counts down bytes between metadata
  int m_controlCounter = 0; // Status within readID3data() and readWaveHeader()
  int8_t m_balance = 0;     // -16 (mute left) ... +16 (mute right)
  uint8_t m_vol = 64;       // volume
  uint8_t m_bitsPerSample = 16; // bitsPerSample
  uint8_t m_channels = 2;
  uint8_t m_i2s_num = I2S_NUM_0; // I2S_NUM_0 or I2S_NUM_1
  uint8_t m_codec = CODEC_NONE;  //
#ifndef AUDIO_NO_NETWORK
  uint8_t m_playlistFormat = 0; // M3U, PLS, ASX
  uint8_t m_expectedCodec =
      CODEC_NONE; // set in connecttohost (e.g. http://url.mp3 -> CODEC_MP3)
  uint8_t m_expectedPlsFmt =
      FORMAT_NONE; // set in connecttohost (e.g. streaming01.m3u) -> FORMAT_M3U)
  uint8_t m_streamType = ST_NONE;
#endif
  uint8_t m_filterType[2];     // lowpass, highpass
  uint8_t m_ID3Size = 0;       // lengt of ID3frame - ID3header
  int16_t m_outBuff[2048 * 2]; // Interleaved L/R
  int16_t m_validSamples = 0;
  int16_t m_curSample = 0;
  uint16_t m_datamode = 0; // Statemaschine
#ifndef AUDIO_NO_NETWORK
  uint16_t m_streamTitleHash =
      0; // remember streamtitle, ignore multiple occurence in metadata
  uint16_t m_timeout_ms = 250;
  uint16_t m_timeout_ms_ssl = 2700;
#endif
  uint8_t m_flacBitsPerSample = 0; // bps should be 16
  uint8_t m_flacNumChannels = 0;   // can be read out in the FLAC file header
  uint32_t m_flacSampleRate = 0;   // can be read out in the FLAC file header
  uint16_t m_flacMaxFrameSize = 0; // can be read out in the FLAC file header
  uint16_t m_flacMaxBlockSize = 0; // can be read out in the FLAC file header
  uint32_t m_flacTotalSamplesInStream =
      0; // can be read out in the FLAC file header
#ifndef AUDIO_NO_NETWORK
  uint32_t m_metaint = 0;    // Number of databytes between metadata
  uint32_t m_chunkcount = 0; // Counter for chunked transfer
  uint32_t m_contentlength =
      0; // Stores the length if the stream comes from fileserver
  uint32_t m_bytesNotDecoded =
      0; // pictures or something else that comes with the stream
#endif
  uint32_t m_t0 = 0; // store millis(), is needed for a small delay
  uint32_t m_PlayingStartTime =
      0; // Stores the milliseconds after the start of the audio
  uint32_t m_resumeFilePos =
      0; // the return value from stopSong() can be entered here
  bool m_f_unsync = false; // set within ID3 tag but not used
  bool m_f_exthdr = false; // ID3 extended header
  bool m_f_running = false;
  bool m_f_firstCall =
      false; // InitSequence for processWebstream and processLokalFile
  bool m_f_playing = false;   // valid mp3 stream recognized
  bool m_f_loop = false;      // Set if audio file should loop
  bool m_f_forceMono = false; // if true stereo -> mono
  bool m_f_internalDAC =
      false; // false: output vis I2S, true output via internal DAC
  bool m_f_Log =
      false; // set in platformio.ini  -DAUDIO_LOG and -DCORE_DEBUG_LEVEL=3 or 4
  uint32_t m_stsz_numEntries = 0; // num of entries inside stsz atom (uint32_t)
                                  // - used for M4A local files
  uint32_t m_stsz_position =
      0; // pos of stsz atom within file - used for M4A local files
#ifndef AUDIO_NO_NETWORK
  uint16_t m_m3u8_targetDuration = 10; //
  bool m_f_metadata = false;           // assume stream without metadata
  bool m_f_ssl = false;
  bool m_f_chunked = false;       // Station provides chunked transfer
  bool m_f_firstmetabyte = false; // True if first metabyte (counter)
  bool m_f_tts = false;           // text to speech
  bool m_f_rtsp = false;          // set if RTSP is used (m3u8 stream)
  bool m_f_m3u8data = false;      // used in processM3U8entries
  bool m_f_continue = false;      // next m3u8 chunk is available
  bool m_f_ts = true;             // transport stream
#endif
  uint8_t m_f_channelEnabled = 3; // internal DAC, both channels
  uint32_t m_audioFileDuration = 0;
  float m_audioCurrentTime = 0;
  uint32_t m_audioDataStart = 0;  // in bytes
  size_t m_audioDataSize = 0;     //
  float m_filterBuff[3][2][2][2]; // IIR filters memory for Audio DSP
  size_t m_i2s_bytesWritten = 0;  // set in i2s_write() but not used
  size_t m_file_size = 0;         // size of the file
  uint16_t m_filterFrequency[2];
  int8_t m_gain0 = 0; // cut or boost filters (EQ)
  int8_t m_gain1 = 0;
  int8_t m_gain2 = 0;

  pid_array m_pidsOfPMT;
  int16_t m_pidOfAAC;
  uint8_t m_packetBuff[m_tsPacketSize];
  int16_t m_pesDataLength = 0;
};

//----------------------------------------------------------------------------------------------------------------------
